In [13]:
import pandas as pd
import numpy as np

In [15]:
sozlukVerisi = {"Istanbul": [30, 29, np.nan], "Ankara": [20, np.nan, 25], "Izmir": [40, 39, 38]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [16]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [17]:
havaDurumuDataFrame.dropna()
##NaN olan satırları siler

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [19]:
havaDurumuDataFrame.dropna(axis =1)

   Izmir
0     40
1     39
2     38

In [20]:
sozlukVerisi1 = {"Istanbul": [30, 29, np.nan], "Ankara": [20, np.nan, 25], "Izmir": [40, 39, 38], "Igdir":[45,np.nan,np.nan]}
havaDurumuDataFrame1 = pd.DataFrame(sozlukVerisi1)

In [21]:
havaDurumuDataFrame1

   Istanbul  Ankara  Izmir  Igdir
0      30.0    20.0     40   45.0
1      29.0     NaN     39    NaN
2       NaN    25.0     38    NaN

In [22]:
havaDurumuDataFrame1.dropna(axis=1,thresh =2)
## 2 ve üzeri Nan olanları siler diğerlerini bırakır.

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [23]:
havaDurumuDataFrame1.fillna(20)
## NaN yazan yerlere belirtilen sayıyı yazar.

   Istanbul  Ankara  Izmir  Igdir
0      30.0    20.0     40   45.0
1      29.0    20.0     39   20.0
2      20.0    25.0     38   20.0

## groupby (gruplandırma)

In [32]:
maasSozlugu = {"Departman" : ["Yazılım", "Yazılım", "Pazarlama","Pazarlama","Hukuk","Hukuk" ],
              "Çalışan İsmi" : ["Ahmet","Mehmet","Atil","Burak","Zeynep","Fatma"],
              "Maas" : [100,150,200,300,400,500]}

In [33]:
maasDataFrame = pd.DataFrame (maasSozlugu)

In [34]:
maasDataFrame

   Departman Çalışan İsmi  Maas
0    Yazılım        Ahmet   100
1    Yazılım       Mehmet   150
2  Pazarlama         Atil   200
3  Pazarlama        Burak   300
4      Hukuk       Zeynep   400
5      Hukuk        Fatma   500

In [35]:
grup= maasDataFrame.groupby("Departman")

In [36]:
grup.count()

           Çalışan İsmi  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2

In [37]:
grup.mean()

C:\Users\Monster\AppData\Local\Temp\ipykernel_3308\626059466.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  grup.mean()

            Maas
Departman
Hukuk      450.0
Pazarlama  250.0
Yazılım    125.0

In [38]:
grup.min()

          Çalışan İsmi  Maas
Departman
Hukuk            Fatma   400
Pazarlama         Atil   200
Yazılım          Ahmet   100

In [40]:
grup.max()

          Çalışan İsmi  Maas
Departman
Hukuk           Zeynep   500
Pazarlama        Burak   300
Yazılım         Mehmet   150

In [41]:
grup.describe()

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0